<a href="https://colab.research.google.com/github/MUHAMMAD-SULEMAN-10/Pandas/blob/main/Pandas_part_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('/content/titanic.csv')

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
#get the data from a colom

In [ ]:
series = df['Name'][0:10]

In [ ]:
series # it is a series becuse it has indexes

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [ ]:
# get a chunk of data from this col
len(series)

10

In [ ]:
type(series )

pandas.core.series.Series

In [ ]:
# give your own indexs to series
#create a list and add names form 0 to 9 etc
#make them indexes

l = ['nomi', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [ ]:
pd.Series(series, index=l)

# now it has converted into indexes but no data becoz it is already in series and make it null

nomi    NaN
b       NaN
c       NaN
d       NaN
e       NaN
f       NaN
g       NaN
h       NaN
i       NaN
j       NaN
Name: Name, dtype: object

In [ ]:
series

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [ ]:
# but when we call list or use list then the data will show

s1 = pd.Series(list(series),index=l)

In [ ]:
s1

nomi                              Braund, Mr. Owen Harris
b       Cumings, Mrs. John Bradley (Florence Briggs Th...
c                                  Heikkinen, Miss. Laina
d            Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                                Allen, Mr. William Henry
f                                        Moran, Mr. James
g                                 McCarthy, Mr. Timothy J
h                          Palsson, Master. Gosta Leonard
i       Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                     Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [ ]:
#now extrac the data from the series , and s1

series[0]

'Braund, Mr. Owen Harris'

In [ ]:
s1[0]

/tmp/ipython-input-643609873.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[0]

'Braund, Mr. Owen Harris'

In [ ]:
s1[0] = 'suleman'

/tmp/ipython-input-436025680.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  s1[0] = 'suleman'

In [ ]:
s1

nomi                                              suleman
b       Cumings, Mrs. John Bradley (Florence Briggs Th...
c                                  Heikkinen, Miss. Laina
d            Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                                Allen, Mr. William Henry
f                                        Moran, Mr. James
g                                 McCarthy, Mr. Timothy J
h                          Palsson, Master. Gosta Leonard
i       Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                     Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [ ]:
# check featuers in the s1 it is a series and check
# series can not append becuae its a string but it will accept the series
s1.append("Usman")

AttributeError: 'Series' object has no attribute 'append'

In [ ]:
s1.append(series)

# append is not working in pands its old now

AttributeError: 'Series' object has no attribute 'append'

In [ ]:
s2 = pd.concat([s1, series])

In [ ]:
s2

nomi                                              suleman
b       Cumings, Mrs. John Bradley (Florence Briggs Th...
c                                  Heikkinen, Miss. Laina
d            Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                                Allen, Mr. William Henry
f                                        Moran, Mr. James
g                                 McCarthy, Mr. Timothy J
h                          Palsson, Master. Gosta Leonard
i       Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                     Nasser, Mrs. Nicholas (Adele Achem)
0                                 Braund, Mr. Owen Harris
1       Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                  Heikkinen, Miss. Laina
3            Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                                Allen, Mr. William Henry
5                                        Moran, Mr. James
6                                 McCarthy, Mr. Timothy J
7                          Palsson, Master. Gosta Leonard
8       Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                     Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [ ]:
s2[0]

'Braund, Mr. Owen Harris'

In [ ]:
s2[4] # its taking by default index

'Allen, Mr. William Henry'

In [ ]:
s4 = pd.Series([3,4,5,6,6], index=[2,4,5,6,1])

In [ ]:
s5 = pd.Series([3,4,45,45,445], index=[9,4,5,6,7])

In [ ]:
s6 = pd.concat([s4,s5])

In [ ]:
 # now the

s6

2      3
4      4
5      5
6      6
1      6
9      3
4      4
5     45
6     45
7    445
dtype: int64

In [ ]:
s6[4] # here every values on the index on 4 will be display but in the previous where defalut was taking on the index 4

4    4
4    4
dtype: int64

In [ ]:
s6[0:5] # heere is taking default index in slicing case

2    3
4    4
5    5
6    6
1    6
dtype: int64

In [ ]:
s5

9      3
4      4
5     45
6     45
7    445
dtype: int64

In [ ]:
s4*s5 # here it will match the numbers like if availabe then give the mul like 1 is only in one sereies give NaN

1      NaN
2      NaN
4     16.0
5    225.0
6    270.0
7      NaN
9      NaN
dtype: float64

In [ ]:
s4+s5

1     NaN
2     NaN
4     8.0
5    50.0
6    51.0
7     NaN
9     NaN
dtype: float64